In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### Create a pandas series with some random numbers and texts and some null values.
- Add some data to your series
-  Change data type to integer
-  Remove the null values
-  Sort the index of your series alphabetically
-  Count the occurrences of unique items of the series
-  Sort the given series in descending order

In [2]:
#Create a pandas series with some random numbers and texts and some null values.

data = np.array(['Machine Learning', 'Deep Learning' ,'Fuse Machine', 3 ])

ser1 = pd.Series(data)

print(ser1)

0    Machine Learning
1       Deep Learning
2        Fuse Machine
3                   3
dtype: object

In [3]:
#Add some data to your series
ser1 = ser1.append(pd.Series(['added', 'values']))
print(ser1)

#Remove the null values

ser1.dropna(inplace=True)
ser1

0    Machine Learning
1       Deep Learning
2        Fuse Machine
3                   3
0               added
1              values
dtype: object

0    Machine Learning
1       Deep Learning
2        Fuse Machine
3                   3
0               added
1              values
dtype: object

In [4]:
# Change data type to integer
new =pd.get_dummies(ser1, prefix='data')
new.astype(int)
new.dtypes

new

,data_3,data_Deep Learning,data_Fuse Machine,data_Machine Learning,data_added,data_values
0,0,0,0,1,0,0
1,0,1,0,0,0,0
2,0,0,1,0,0,0
3,1,0,0,0,0,0
0,0,0,0,0,1,0
1,0,0,0,0,0,1

***

### Create a dataframe having 5 columns and 50 random data
- Retrieve the data from index 30-40 with the first 3 columns (Note: Use column index only)
-  Retrieve last 10 rows of 2nd and 5th columns (Note: Use column name only)
-  Retrieve 1st and 5th column with some condition applied to 2nd column (Condition Example: all rows having value greater than x).
- Sample some of the data from the 1st column into a list and add some additional random data in it. Filter the dataframe and retrieve only those rows if 1st column contains the sampled data (Explore ‘isin’)
- Update the value of the 1st and 3rd column with new values in the 35th index of row
- Delete the row of the index position: 35, 39, 51. And reindex the dataframe

In [5]:
#Create a dataframe having 5 columns and 50 random data

df = pd.DataFrame(np.random.randint(0,100,size=(50, 5)), columns=list('ABCDE'))

In [6]:
#Retrieve the data from index 30-40 with the first 3 columns (Note: Use column index only)

retriving1 = df[['A','B','C']][30:41]
# print(retriving1)

In [7]:
# Retrieve 1st and 5th column with some condition applied to 2nd column (Condition Example: all rows having value greater than x).

retriving2 =df[df['B']<25][['A','E']]
# retriving2

In [8]:
# Sample some of the data from the 1st column into a list and add some additional random data in it.

other = df[df['B']<25][['A','B','C','D','E']]

new_df = pd.DataFrame(np.random.randint(0,100,size=(9, 5)), columns=list('ABCDE'))

new_df = new_df.append(other , ignore_index = True)

# Filter the dataframe and retrieve only those rows if 1st column contains the sampled data (Explore ‘isin’)

col1 = new_df['A']
filterd = df[df['A'].isin(col1)]

# filterd

In [9]:
# Update the value of the 1st and 3rd column with new values in the 35th index of row

one_row = df.loc[35]
# one_row = one_row['A']

df.loc[1]['A'] = one_row['A']
df.loc[1]['C'] = one_row['C']

df.loc[3]['A'] = one_row['A']
df.loc[3]['C'] = one_row['C']

In [10]:
# Delete the row of the index position: 35, 39, 51. And reindex the dataframe

df.drop([35,39], inplace=True) #droping the selected index
df.reset_index(drop = True , inplace=True) #resetting index

#There is no 51th index, as we have created only 50 items

In [11]:
# df

***

### Create two dataframe (first dataframe having 50 random data and second dataframe having 40 random data). Each dataframe should have 3 columns including a common column (example: id) and 90% of data in common column should have identical data
#### Merge both the dataframe using:
- Inner
- Outer
- Left
- Right
- Evaluate the differences observed
##### Use join() to combine the dataframe
##### Use concat to combine the dataframe
##### Evaluate the differences observed between merge, join and concat

In [12]:
# Create two dataframe (first dataframe having 50 random data and second dataframe having 40 random data). Each dataframe should have 3 columns including a common column (example: id) and 90% of data in common column should have identical data

common_c= pd.Series(np.random.randint(10, size=36))
df1 = pd.DataFrame(np.random.randint(0,50,size=(50, 3)), columns=list('ABC'))
df2 = pd.DataFrame(np.random.randint(0,40,size=(50, 3)), columns=list('CDE'))

df1_sam = df1.sample(36)
df2_sam = df2.sample(36)

ind1 = df1_sam.index
df1.loc[ind1, 'C'] = common_c.tolist()

ind2 = df2_sam.index
df2.loc[ind2, 'C'] = common_c.tolist()

In [13]:
# Merge both the dataframe using:
# - Inner

inner = pd.merge(df1, df2, how="inner" , on ='C')
# inner


# Evaluation

In [14]:
# - Outer

outer = pd.merge(df1, df2, how="outer" , on ='C')
# outer

# Evaluation

In [15]:

# - Left

left = pd.merge(df1, df2, how="left" , on ='C')
# left

In [16]:
# - Right

right = pd.merge(df1, df2, how="right" , on ='C')
# right

In [17]:
# Use join() to combine the dataframe

join_data = df1.join(df2 , how = 'inner', on='C', rsuffix='c')
# join_data

In [18]:
# Use concat to combine the dataframe
join_data = pd.concat([df1 , df2], ignore_index=False)

join_data

       A     B  C     D     E
0   18.0  28.0  6   NaN   NaN
1   45.0  27.0  1   NaN   NaN
2   18.0  17.0  6   NaN   NaN
3   15.0  25.0  3   NaN   NaN
4   44.0  47.0  2   NaN   NaN
..   ...   ... ..   ...   ...
45   NaN   NaN  4  34.0   1.0
46   NaN   NaN  7   4.0  17.0
47   NaN   NaN  7  35.0   4.0
48   NaN   NaN  8   9.0  20.0
49   NaN   NaN  0   5.0  10.0

[100 rows x 5 columns]

In [19]:
# Evaluate the differences observed between merge, join and concat

****
### Create a dataframe having 3 columns: name, nationality, age and perform:
- Use filter() to get all data of column name and age
- Retrieve all the data of the column starting with “na”
- Retrieve all the data of the column ending with “e”
- Retrieve all the data of the column having subset “am” (hint: explore ‘like’ in filter())

In [20]:
dict = {
    "name":['Ragnar', 'Floki', 'Lagaretha', 'Ivar'],
    "nationality":['USA', 'UK', 'Nepali', 'India'],
    "age":[18, 20,21, 23 ]
}

new_df = pd.DataFrame(dict)
new_df

        name nationality  age
0     Ragnar         USA   18
1      Floki          UK   20
2  Lagaretha      Nepali   21
3       Ivar       India   23

In [21]:
# Use filter() to get all data of column name and age
dataframe = new_df.filter(['name','age'])
dataframe

        name  age
0     Ragnar   18
1      Floki   20
2  Lagaretha   21
3       Ivar   23

In [22]:
# Retrieve all the data of the column starting with “na”

dataframe = new_df.filter(regex = '^(na)')
dataframe

        name nationality
0     Ragnar         USA
1      Floki          UK
2  Lagaretha      Nepali
3       Ivar       India

In [23]:
# Retrieve all the data of the column ending with “e”

dataframe = new_df.filter(regex = '(e)$')
dataframe

        name  age
0     Ragnar   18
1      Floki   20
2  Lagaretha   21
3       Ivar   23

In [24]:
# Retrieve all the data of the column having subset “am”

dataframe = new_df.filter(like = 'am')
dataframe

        name
0     Ragnar
1      Floki
2  Lagaretha
3       Ivar

***

### Use this (raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_daily_reports/01-01-2021.csv) dataset and perform the following tasks:
#### Read the dataset as pandas dataframe
##### Filter the Country_Region whose value == “India” and assign it in dataframe df_india.
- Retrieve the active cases of “Madhya Pradesh” Province from df_india.
- Retrieve the state with the maximum number of confirmed cases from df_india.
- Filter the Country_Region whose value == “Canada” and assign it in dataframe df_canada.
- Province/State Diamond Princess has the “NaN” value for Active number of cases. Fill it with the median of the Active cases.
- Filter the Country_Region whose value == “US” and assign it in dataframe df_us.
- Groupby the df_us dataframe by ‘State_Province’ and aggregate with maximum values of the attributes and assign it in df_us_states.
-  Re-index the dataframe df_us_states.
-  The United States has 50 states. df_us_states contains additional states which are not the states of the United States. Remove those additional states from the dataframe.
- Which state has the minimum number of active cases?
##### Find the number of cases for each country

In [4]:
# Read the dataset as pandas dataframe

datas = pd.read_csv('https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_daily_reports/01-01-2021.csv')

In [5]:
# Retrieve the active cases of “Madhya Pradesh” Province from df_india.
df_india =datas[ datas['Country_Region'] == 'India']

In [6]:
# Retrieve the state with the maximum number of confirmed cases from df_india.
df_india_state = df_india[['Province_State', 'Confirmed']]
df_india_state = df_india_state.sort_values('Confirmed' , ascending = False)
# df_india_state

In [59]:
# Filter the Country_Region whose value == “Canada” and assign it in dataframe df_canada.

df_canada = datas[ datas['Country_Region'] == 'Canada']

In [64]:
# Province/State Diamond Princess has the “NaN” value for Active number of cases. Fill it with the median of the Active cases.

df_canada = df_canada.fillna(df_canada.median(skipna = True))

# df_canada

In [ ]:
# Filter the Country_Region whose value == “US” and assign it in dataframe df_us.

df_us = datas[ datas['Country_Region'] == 'US']